couettePlacasPlanas/Re-10/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     7.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    xNeg
    {
        type            cyclic;
    }
    xPos
    {
        type            cyclic;
    }
    yPos
    {
        type            zeroGradient;
    }
    yNeg
    {
        type            zeroGradient;
    }
    zPlan
    {
        type            empty;
    }
}


// ************************************************************************* //
