couettePlacasPlanas/Re-10/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
xCanal 0.1;
dCanal 0.1;
zCanal 0.01;
nY	5;

vertices
(
    (0 		0   		0)		//v0
    ($xCanal 	0   		0)		//v1
    ($xCanal 	$dCanal 	0)		//v2
    (0 		$dCanal 	0)		//v3
    (0 		0   		$zCanal)	//v4
    ($xCanal 	0   		$zCanal)	//v5
    ($xCanal 	$dCanal 	$zCanal)	//v6
    (0 		$dCanal 	$zCanal)	//v7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 $nY 1) simpleGrading (1 1 1)
);

boundary
(
    xNeg
    {
        type cyclic;
        neighbourPatch xPos;
        faces
        (
            (0 3 7 4)
        );
    }
    xPos
    {
        type cyclic;
        neighbourPatch xNeg;
        faces
        (
            (5 6 2 1)
        );
    }
    yPos
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }
    yNeg
    {
        type wall;
        faces
        (
            (4 5 1 0)
        );
    }
    zPlan
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (7 6 5 4)
        );
    }
);

// ************************************************************************* //
